# GetRebarId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetRebarId Method
RebarUpdateCurvesData Class See Also
---
Get the id of the Rebar element currently being calculated.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public ElementId GetRebarId()
```

Visual Basic
---
```text
Public Function GetRebarId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetRebarId()
```

# ### Return Value
returns the id of the Rebar element currently being calculated
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace